{"keras_version": "2.0.9", "config": [{"config": {"strides": [1, 1], "kernel_regularizer": null, "dtype": "float32", "data_format": "channels_last", "filters": 32, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_7", "trainable": true, "batch_input_shape": [null, 128, 3, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "kernel_size": [2, 2]}, "class_name": "Conv2D"}, {"config": {"strides": [4, 1], "name": "max_pooling2d_7", "trainable": true, "data_format": "channels_last", "pool_size": [4, 1], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "filters": 64, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_8", "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [2, 2]}, "class_name": "Conv2D"}, {"config": {"strides": [4, 1], "name": "max_pooling2d_8", "trainable": true, "data_format": "channels_last", "pool_size": [4, 1], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_4", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "trainable": true, "name": "dense_10", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "trainable": true, "name": "dense_11", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "trainable": true, "name": "dense_12", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}